---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerNotConnectToHost
source: html/001f5115-a02a-8973-ca1f-a78a12185ea7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerNotConnectToHost Property

Fabrication Hanger didn't connect to the %s host.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationHangerNotConnectToHost { get; }
```